In [1]:
import pandas as pd
import numpy as np
import seaborn as sns
titanic = sns.load_dataset("titanic")

### 1. Titanic - sns.load_dataset('titanic')
#### a. 타이타닉호의 승객에 대해 나이와 성별에 의한 카테고리 열인 category1 열을 만드시오. category1 카테고리는 다음과 같이 정의됨

- 1)20살이 넘으면 성별을 그대로 사용한다.
- 2)20살 미만이면 성별에 관계없이 “child”라고 한다.

In [91]:
titanic['category1'] = titanic.apply(lambda r: r.sex if r.age >= 20 else "child", axis=1)
titanic.tail()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,category1
886,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True,male
887,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True,child
888,0,3,female,NaN,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False,child
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True,male
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True,male

#### b.타이타닉호의 승객 중 나이를 명시하지 않은 고객은 나이를 명시한 고객의 평균 나이 값이 되도록 titanic 데이터프레임을 고치시오.

In [2]:
titanic["age"].fillna(round(titanic.mean()['age']), inplace=True)
titanic.tail()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
886,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,30.0,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True

#### c.성별, 선실(class)별, 출발지(embark_town)별 생존율을 구하시오.

In [99]:
# 선실(class)별 생존률
titanic.groupby('class')[['survived']].mean()

        survived
class
First   0.629630
Second  0.472826
Third   0.242363

In [97]:
# 성별 생존률
titanic.groupby('sex')[['survived']].mean()

        survived
sex
female  0.742038
male    0.188908

In [98]:
# 출발지별 생존률
titanic.groupby('embark_town')[['survived']].mean()

             survived
embark_town
Cherbourg    0.553571
Queenstown   0.389610
Southampton  0.336957

#### d.타이타닉호 승객을 ‘미성년자’, ‘청년’, ‘중년’, ‘장년’, ‘노년’ 나이 그룹으로 나누고, 각 그룹별 생존율을 구하시오.

In [4]:
# age시리즈를 리스트로 변환
age_list = titanic["age"].tolist()

In [6]:
ages = age_list
bins = [1, 20, 30, 50, 70, 100]
labels = ["미성년자", "청년", "중년", "장년", "노년"]
titanic['group'] = pd.cut(ages, bins, labels=labels)  
# 리스트로 만든 ages 대신에 titanic.age.values 를 사용해도 됨
titanic.tail()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,group
886,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True,청년
887,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True,미성년자
888,0,3,female,30.0,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False,청년
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True,청년
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True,중년

In [103]:
# 나이 그룹별 생존률
titanic.groupby('group')[['survived']].mean()

       survived
group
미성년자   0.424242
청년     0.334152
중년     0.423237
장년     0.355932
노년     0.200000

#### e. qcut 명령으로 세 개의 나이 그룹을 만들고, 나이 그룹별 남녀 성비와 생존율을 구하시오.

In [7]:
titanic['group2'] = pd.qcut(ages, 3, labels=["Q1", "Q2", "Q3"])
titanic.tail()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,group,group2
886,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True,청년,Q2
887,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True,미성년자,Q1
888,0,3,female,30.0,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False,청년,Q2
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True,청년,Q2
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True,중년,Q3

In [8]:
# gender 컬럼 추가하기 -- 남자면 1, 여자면 0을 부여
titanic['gender'] = titanic.apply(lambda r: 1 if r.sex=='male' else 0, axis=1)
titanic.tail()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,group,group2,gender
886,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True,청년,Q2,1
887,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True,미성년자,Q1,0
888,0,3,female,30.0,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False,청년,Q2,0
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True,청년,Q2,1
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True,중년,Q3,1

In [11]:
# 나이 그룹별 성비와 생존률 -- groupby 이용
titanic.groupby('group2')[['survived','gender']].mean()

        survived    gender
group2
Q1      0.411960  0.594684
Q2      0.335526  0.680921
Q3      0.405594  0.667832

In [9]:
# 나이 그룹별 성비와 생존률 -- pivot_table 이용
titanic.pivot_table(['survived','gender'],'group2')

          gender  survived
group2
Q1      0.594684  0.411960
Q2      0.680921  0.335526
Q3      0.667832  0.405594

### 2. Mile Per Gallon - sns.load_dataset('mpg')

#### a.배기량(displacement) 대비 마력(horsepower) 열(hp_per_cc)을 추가하시오.

In [15]:
mpg=sns.load_dataset('mpg')
mpg['hp_per_cc']=mpg.horsepower/mpg.displacement
mpg.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name,hp_per_cc
0,18.0,8,307.0,130.0,3504,12.0,70,usa,chevrolet chevelle malibu,0.423453
1,15.0,8,350.0,165.0,3693,11.5,70,usa,buick skylark 320,0.471429
2,18.0,8,318.0,150.0,3436,11.0,70,usa,plymouth satellite,0.471698
3,16.0,8,304.0,150.0,3433,12.0,70,usa,amc rebel sst,0.493421
4,17.0,8,302.0,140.0,3449,10.5,70,usa,ford torino,0.463576

#### b.name으로부터 manufacturer(제조사)와 모델을 추출하여 새로운 열 manufacturer와 model을 추가하고, name 열은 삭제하시오.

In [16]:
# name에서 제조사 추출
# split() - 띄어쓰기 기준으로 단어를 분리하여 리스트로 저장 
mpg['manu'] = mpg['name'].apply(lambda x: x.split()[0])

# name에서 제조사 제외한 나머지만 추출하여 model으로 열 이름을 바꾸기
# "".join() - 리스트를 문자열로 바꿔서 저장
mpg['model'] = mpg['name'].apply(lambda x:" ".join(x.split()[1:]))

# name열을 삭제
mpg = mpg.drop('name',axis=1)

mpg.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,hp_per_cc,manu,model
0,18.0,8,307.0,130.0,3504,12.0,70,usa,0.423453,chevrolet,chevelle malibu
1,15.0,8,350.0,165.0,3693,11.5,70,usa,0.471429,buick,skylark 320
2,18.0,8,318.0,150.0,3436,11.0,70,usa,0.471698,plymouth,satellite
3,16.0,8,304.0,150.0,3433,12.0,70,usa,0.493421,amc,rebel sst
4,17.0,8,302.0,140.0,3449,10.5,70,usa,0.463576,ford,torino

#### c.엔진의 실린더(cylinders) 갯수별 연비(mpg)의 평균을 구하시오.

In [45]:
mpg.groupby('cylinders')[['mpg']].mean()

                 mpg
cylinders
3          20.550000
4          29.286765
5          27.366667
6          19.985714
8          14.963107

#### d.생산지(origin)별 배기량 대비 마력(hp_per_cc)의 평균을 구하시오.

In [44]:
mpg.groupby('origin')[['hp_per_cc']].mean()

        hp_per_cc
origin
europe   0.740005
japan    0.789485
usa      0.512063

#### e.모델이 5개 이상인 제조사에 대하여 연비(mpg)의 평균이 가장 좋은 제조사 Top 5를 구하시오.

In [26]:
# 선생님풀이
mpg.manu.value_counts()

ford             51
chevrolet        43
plymouth         31
dodge            28
amc              28
toyota           25
datsun           23
buick            17
pontiac          16
volkswagen       15
honda            13
mercury          11
oldsmobile       10
mazda            10
fiat              8
peugeot           8
audi              7
volvo             6
vw                6
chrysler          6
renault           5
saab              4
opel              4
subaru            4
chevy             3
mercedes-benz     2
maxda             2
cadillac          2
bmw               2
vokswagen         1
toyouta           1
chevroelt         1
nissan            1
capri             1
mercedes          1
triumph           1
hi                1
Name: manu, dtype: int64

In [27]:
type(mpg.manu.value_counts())

pandas.core.series.Series

In [19]:
s = mpg.manu.value_counts()
big = s[s>=5].index.tolist()
print(big)

['ford', 'chevrolet', 'plymouth', 'dodge', 'amc', 'toyota', 'datsun', 'buick', 'pontiac', 'volkswagen', 'honda', 'mercury', 'oldsmobile', 'mazda', 'fiat', 'peugeot', 'audi', 'volvo', 'vw', 'chrysler', 'renault']

In [21]:
# in 연산자 대신에 isin() method 사용
mpg[mpg.manu.isin(big)].head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,hp_per_cc,manu,model
0,18.0,8,307.0,130.0,3504,12.0,70,usa,0.423453,chevrolet,chevelle malibu
1,15.0,8,350.0,165.0,3693,11.5,70,usa,0.471429,buick,skylark 320
2,18.0,8,318.0,150.0,3436,11.0,70,usa,0.471698,plymouth,satellite
3,16.0,8,304.0,150.0,3433,12.0,70,usa,0.493421,amc,rebel sst
4,17.0,8,302.0,140.0,3449,10.5,70,usa,0.463576,ford,torino

In [22]:
big_mpg = mpg[mpg.manu.isin(big)]
big_mpg[['manu','mpg']].groupby('manu').mean().sort_values(by='mpg',ascending=False)[:5]

               mpg
manu
vw       39.016667
honda    33.761538
renault  32.880000
datsun   31.113043
mazda    30.860000

- filter 사용

In [24]:
new_mpg = mpg.groupby('manu').filter(lambda x: x.manu.count() >=5)
new_mpg.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,hp_per_cc,manu,model
0,18.0,8,307.0,130.0,3504,12.0,70,usa,0.423453,chevrolet,chevelle malibu
1,15.0,8,350.0,165.0,3693,11.5,70,usa,0.471429,buick,skylark 320
2,18.0,8,318.0,150.0,3436,11.0,70,usa,0.471698,plymouth,satellite
3,16.0,8,304.0,150.0,3433,12.0,70,usa,0.493421,amc,rebel sst
4,17.0,8,302.0,140.0,3449,10.5,70,usa,0.463576,ford,torino

- 나의 풀이

In [5]:
# 모델이 5개 이상인 제조사만 있는 데이터프레임 추출
mpg_new = mpg.groupby('manu')[['model']].count()
mpg_new2 = mpg_new[mpg_new.model >= 5]
mpg_new2

            model
manu
amc            28
audi            7
buick          17
chevrolet      43
chrysler        6
datsun         23
dodge          28
fiat            8
ford           51
honda          13
mazda          10
mercury        11
oldsmobile     10
peugeot         8
plymouth       31
pontiac        16
renault         5
toyota         25
volkswagen     15
volvo           6
vw              6

In [10]:
my_mpg = pd.merge(mpg_new2, mpg, on='manu',how='inner')
my_mpg.tail()

,manu,model_x,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,hp_per_cc,model_y
362,vw,6,31.9,4,89.0,71.0,1925,14.0,79,europe,0.797753,rabbit custom
363,vw,6,41.5,4,98.0,76.0,2144,14.7,80,europe,0.775510,rabbit
364,vw,6,44.3,4,90.0,48.0,2085,21.7,80,europe,0.533333,rabbit c (diesel)
365,vw,6,43.4,4,90.0,48.0,2335,23.7,80,europe,0.533333,dasher (diesel)
366,vw,6,44.0,4,97.0,52.0,2130,24.6,82,europe,0.536082,pickup

In [14]:
# 상위 5개 제조사
top5 = my_mpg.groupby('manu').mean().sort_values(by='mpg',ascending=False).head(5)
top5

,model_x,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,hp_per_cc
manu,,,,,,,,,
vw,6.0,39.016667,4.00000,92.333333,60.833333,2092.666667,18.816667,79.500000,0.658965
honda,13.0,33.761538,4.00000,97.230769,67.846154,2023.384615,15.992308,78.923077,0.695736
renault,5.0,32.880000,4.00000,92.200000,70.000000,2074.200000,17.000000,77.200000,0.758236
datsun,23.0,31.113043,4.26087,103.260870,83.826087,2242.217391,16.408696,76.869565,0.815750
mazda,10.0,30.860000,3.70000,89.700000,77.700000,2272.200000,16.440000,79.300000,0.909519

In [19]:
top5_new=top5.reset_index()

In [20]:
top5_new.iloc[:,:1]

      manu
0       vw
1    honda
2  renault
3   datsun
4    mazda